{
  "short": [
    "대한민국은 민주공화국이다.",
    "대한민국의 주권은 국민에게 있다.",
    "모든 권력은 국민으로부터 나온다.",
    "모든 국민은 법 앞에 평등하다.",
    "모든 국민은 신체의 자유를 가진다.",
    "모든 국민은 사생활의 비밀을 보호받는다.",
    "모든 국민은 언론의 자유를 가진다.",
    "모든 국민은 집회의 자유를 가진다.",
    "모든 국민은 재산권을 가진다.",
    "모든 국민은 교육을 받을 권리를 가진다.",
    "모든 국민은 인간다운 생활을 할 권리를 가진다.",
    "모든 국민은 공무담임권을 가진다.",
    "모든 국민은 근로의 권리를 가진다.",
    "모든 국민은 환경권을 가진다.",
    "모든 국민은 학문의 자유를 가진다.",
    "모든 국민은 양심의 자유를 가진다.",
    "모든 국민은 신앙의 자유를 가진다.",
    "모든 국민은 재판을 받을 권리를 가진다.",
    "모든 국민은 변호인의 도움을 받을 권리를 가진다.",
    "모든 국민은 자유롭게 직업을 선택할 권리를 가진다.",
    "모든 국민은 적법한 절차에 의해 보호받는다.",
    "모든 국민은 고문받지 아니한다.",
    "모든 국민은 고충을 청원할 권리를 가진다.",
    "모든 국민은 형사상 자기에게 불리한 진술을 강요당하지 아니한다.",
    "모든 국민은 신속한 구제를 받을 권리를 가진다.",
    "모든 국민은 과잉금지의 원칙에 따라 보호받는다.",
    "모든 국민은 적법한 절차에 의하지 아니하고는 처벌받지 아니한다.",
    "모든 국민은 잔인한 형벌을 받지 아니한다.",
    "모든 국민은 폭력에 의한 억압을 받지 아니한다.",
    "모든 국민은 통신의 비밀을 보장받는다.",
    "모든 국민은 국가의 보호를 받을 권리를 가진다.",
    "모든 국민은 평등하게 대우받을 권리를 가진다.",
    "모든 국민은 언론의 자유를 보장받는다.",
    "모든 국민은 출판의 자유를 가진다.",
    "모든 국민은 예술의 자유를 가진다.",
    "모든 국민은 교육의 자유를 가진다.",
    "모든 국민은 행복을 추구할 권리를 가진다.",
    "모든 국민은 차별을 받지 아니한다.",
    "모든 국민은 국가의 보호를 받는다.",
    "모든 국민은 법률에 의하여 보호받는다.",
    "모든 국민은 국민으로서의 기본적 의무를 진다.",
    "모든 국민은 법률이 정하는 바에 따라 국가의 보호를 받는다.",
    "모든 국민은 자유롭고 공정한 선거를 보장받는다.",
    "모든 국민은 공공의 복리를 증진할 의무를 진다.",
    "모든 국민은 공공의 안전을 보호할 의무를 진다.",
    "모든 국민은 국방의 의무를 진다.",
    "모든 국민은 납세의 의무를 진다.",
    "모든 국민은 공공질서를 준수할 의무를 진다.",
    "모든 국민은 국가를 보호할 의무를 진다.",
    "모든 국민은 국가의 안전을 위해 협력해야 한다."
  ],
  "medium": [
    "대한민국은 민주공화국으로서 주권은 국민에게 있고, 모든 권력은 국민으로부터 나온다. 국가는 국민의 자유와 권리를 보호하며, 민주적 기본질서를 유지해야 한다.",
    "모든 국민은 인간으로서의 존엄과 가치를 가지며, 행복을 추구할 권리를 가진다. 국가는 이를 보장할 의무를 지며, 공공복리를 위해 필요할 때 제한할 수 있다.",
    "모든 국민은 신체의 자유를 가지며, 법률과 적법한 절차에 의하지 아니하고는 체포, 구속, 압수, 수색 또는 심문을 받지 않는다.",
    "모든 국민은 법 앞에 평등하며, 누구든지 성별, 종교, 사회적 신분에 의하여 차별받지 아니한다. 국가는 이를 보장하기 위한 법률과 제도를 마련해야 한다.",
    "모든 국민은 사생활의 비밀과 자유를 침해받지 아니하며, 통신의 비밀을 보장받는다. 국가는 이를 위한 적절한 보호조치를 취해야 한다.",
    "모든 국민은 언론, 출판, 집회 및 결사의 자유를 가지며, 공공의 안녕질서를 위하여 필요한 경우에 한하여 법률로써 제한할 수 있다.",
    "모든 국민은 재산권을 가지며, 그 내용과 한계는 법률로 정한다. 재산권의 행사는 공공복리에 적합하도록 하여야 한다.",
    "모든 국민은 근로의 권리를 가지며, 국가는 고용의 증진과 적정 임금의 보장을 위해 노력해야 한다. 근로조건의 기준은 법률로 정한다.",
    "모든 국민은 교육을 받을 권리를 가지며, 국가는 의무교육을 무상으로 실시해야 한다. 교육의 중립성과 자율성을 보장해야 한다.",
    "모든 국민은 인간다운 생활을 할 권리를 가지며, 국가는 사회보장과 사회복지의 증진에 노력해야 한다.",
    "모든 국민은 공무를 담당할 권리를 가지며, 공무원의 임용은 공정하게 이루어져야 한다. 국가는 공직의 청렴성을 확보해야 한다.",
    "모든 국민은 신속한 재판을 받을 권리를 가지며, 법률이 정하는 바에 따라 공정한 재판을 받을 권리를 가진다.",
    "모든 국민은 자신의 사상과 양심의 자유를 가지며, 국가는 이를 보장해야 한다. 사상과 양심의 자유는 법률로 제한할 수 없다.",
    "모든 국민은 종교의 자유를 가지며, 국가는 종교의 중립을 유지해야 한다. 국가는 특정 종교를 지지하거나 차별해서는 안 된다.",
    "모든 국민은 학문의 자유를 가지며, 국가는 학문과 기술의 발전을 위하여 필요한 조치를 취해야 한다.",
    "모든 국민은 예술의 자유를 가지며, 국가는 예술의 발전과 보존을 위해 노력해야 한다. 예술적 표현의 자유는 보장되어야 한다.",
    "모든 국민은 자신의 신체와 재산에 대한 안전을 보장받을 권리를 가지며, 국가는 이를 보호할 의무를 진다.",
    "모든 국민은 직업 선택의 자유를 가지며, 국가는 이를 보장해야 한다. 직업의 자유는 공공복리를 위해 제한될 수 있다.",
    "모든 국민은 주거의 자유를 가지며, 국가는 국민의 주거안정을 위해 노력할 의무를 진다. 주거권은 보장되어야 한다.",
    "모든 국민은 사생활의 비밀과 자유를 보호받을 권리를 가지며, 국가는 이를 위한 법적 제도를 마련해야 한다.",
    "모든 국민은 공공의 안전과 질서를 유지하기 위하여 필요한 법률을 준수할 의무를 가진다.",
    "모든 국민은 자유롭고 공정한 선거를 통해 대표자를 선출할 권리를 가진다. 국가는 공정한 선거를 보장해야 한다.",
    "모든 국민은 공무담임권을 가지며, 공무원의 임용은 공정하게 이루어져야 한다. 국가는 공무원의 신분과 직무를 보호해야 한다.",
    "모든 국민은 자신의 권리를 보호받기 위해 법원에 재판을 청구할 권리를 가진다. 국가는 공정한 재판을 보장해야 한다.",
    "모든 국민은 신속한 구제를 받을 권리를 가지며, 국가는 이를 보장할 의무를 진다.",
    "모든 국민은 헌법소원을 청구할 권리를 가지며, 헌법재판소는 이를 심판할 권한을 가진다.",
    "모든 국민은 자신의 재산을 보호받을 권리를 가지며, 국가는 이를 보장할 의무를 진다. 재산권은 법률로 보호된다.",
    "모든 국민은 법률이 정하는 바에 따라 국방의 의무를 진다. 국가는 국민의 안전을 위해 필요한 군사력을 유지해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 납세의 의무를 진다. 국가는 공정하고 투명한 세금 제도를 유지해야 한다.",
    "모든 국민은 국가의 법질서를 준수할 의무를 가지며, 이는 국가의 안전과 질서유지를 위하여 필요하다.",
    "모든 국민은 국가의 안전을 위해 필요한 경우 법률이 정하는 바에 따라 자신의 권리를 제한받을 수 있다.",
    "모든 국민은 적법한 절차에 따라 자유와 권리를 제한받을 수 있으며, 이러한 제한은 법률로써만 할 수 있다.",
    "모든 국민은 공공복리를 위하여 자신의 재산을 사용할 수 있으며, 그 사용에 대하여는 정당한 보상을 받을 권리를 가진다.",
    "모든 국민은 공공의 이익을 위하여 법률이 정하는 바에 따라 자신의 재산을 사용할 수 있다.",
    "모든 국민은 헌법과 법률이 정하는 바에 따라 국민의 기본권을 보호받을 권리를 가진다.",
    "모든 국민은 국가에 대한 충성의 의무를 가지며, 국가는 이를 보장하기 위한 정책을 추진해야 한다.",
    "모든 국민은 재판 절차에서 신속하고 공정한 재판을 받을 권리를 가진다. 국가는 사법부의 독립성을 보장해야 한다.",
    "모든 국민은 변호인의 도움을 받을 권리를 가지며, 이는 공정한 재판을 받기 위한 필수적인 권리이다.",
    "모든 국민은 범죄로 인하여 피해를 입은 경우 법률이 정하는 바에 따라 국가로부터 일정한 배상을 받을 권리를 가진다.",
    "모든 국민은 고문을 받지 아니하며, 잔인한 형벌을 받지 아니한다. 국가는 이를 보장할 의무를 진다.",
    "모든 국민은 건강하고 안전한 생활을 영위할 권리를 가지며, 국가는 이를 위한 정책을 추진해야 한다.",
    "모든 국민은 자신의 권리를 보호받기 위하여 필요한 경우 법률이 정하는 바에 따라 변호인의 도움을 받을 권리를 가진다.",
    "모든 국민은 공공의 안전과 질서를 유지하기 위하여 필요한 법률을 준수할 의무를 가진다.",
    "모든 국민은 국가의 안전을 위해 필요한 경우 법률이 정하는 바에 따라 자신의 권리를 제한받을 수 있다.",
    "모든 국민은 법률이 정하는 바에 따라 공무를 수행할 권리를 가진다. 공무원의 임용과 승진은 공정하게 이루어져야 한다.",
    "모든 국민은 자신의 권리를 보호받기 위해 법원에 재판을 청구할 권리를 가진다. 국가는 공정한 재판을 보장해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 적법한 절차에 의하지 아니하고는 처벌받지 아니한다.",
    "모든 국민은 법률이 정하는 바에 따라 신체의 자유를 제한받을 수 있다.",
    "모든 국민은 법률이 정하는 바에 따라 신앙의 자유를 가진다."
  ],
  "long": [
    "대한민국은 민주공화국으로서 주권은 국민에게 있고, 모든 권력은 국민으로부터 나온다. 이 원칙은 국민이 국가의 모든 통치 행위의 근원이라는 것을 의미하며, 국가의 주권이 국민에게 있다는 것을 명확히 한다. 국가는 국민의 자유와 권리를 최대한 보장하기 위해 노력해야 하며, 국가의 모든 기관은 국민의 의사에 따라 운영되어야 한다. 대한민국은 또한 국제 평화와 안전을 유지하고, 세계 평화와 인류 공동의 번영을 추구해야 하며, 평화적 통일을 지향하는 국가로서의 역할을 다해야 한다. 이를 위해 국가는 국내외적으로 평화로운 환경을 조성하고, 국제사회에서의 역할을 성실히 수행해야 한다.",
    "모든 국민은 인간으로서의 존엄과 가치를 가지며, 행복을 추구할 권리를 가진다. 국가는 이를 보장할 의무를 지며, 이러한 권리는 국가 안전보장, 질서유지 또는 공공복리를 위하여 필요한 경우에 한하여 법률로써 제한할 수 있다. 그러나 그러한 제한은 자유와 권리의 본질적인 내용을 침해해서는 안 된다. 국가는 국민의 기본적 인권을 보호하고, 모든 국민이 자유롭고 평등한 삶을 영위할 수 있도록 노력해야 한다. 이와 관련하여 국가가 법률을 제정하거나 정책을 시행할 때, 국민의 기본권을 침해하지 않도록 신중을 기해야 한다.",
    "모든 국민은 신체의 자유를 가지며, 누구든지 법률과 적법한 절차에 의하지 아니하고는 체포, 구속, 압수, 수색 또는 심문을 받지 아니하며, 법률과 적법한 절차에 의하지 아니하고는 처벌, 보안처분 또는 강제노역을 받지 아니한다. 이는 개인의 신체적 자유와 권리가 부당하게 제한되거나 침해되지 않도록 보호하는 장치이다. 국가는 이러한 원칙을 준수하여 공권력을 행사하여야 하며, 모든 형태의 고문 및 잔인한 처벌을 금지해야 한다. 또한, 국가의 공권력 남용을 방지하고, 법적 절차를 엄격히 준수함으로써 국민의 신체와 자유를 보호해야 한다.",
    "모든 국민은 법 앞에 평등하며, 누구든지 성별, 종교, 사회적 신분에 의하여 정치적, 경제적, 사회적 생활의 모든 영역에서 차별받지 아니한다. 사회적 특수계급의 제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다. 이는 모든 국민이 평등하게 대우받을 권리를 가진다는 것을 명시하며, 국가와 사회는 이러한 평등의 원칙을 실현하기 위해 노력해야 한다. 특히, 법률과 제도는 모든 국민에게 동등한 권리와 기회를 제공하도록 설계되어야 하며, 어떠한 차별도 허용되어서는 안 된다. 이 원칙은 모든 국민이 자신의 능력과 자질에 따라 자유롭게 사회에 참여하고, 공정한 기회를 누릴 수 있도록 보장한다.",
    "모든 국민은 사생활의 비밀과 자유를 침해받지 아니하며, 통신의 비밀을 보장받는다. 국가는 이에 대한 적절한 보호조치를 취하여야 하며, 어떠한 경우에도 사적 영역에 대한 부당한 침해는 허용되지 않는다. 이는 개인의 사생활이 존중받아야 한다는 원칙을 명시하며, 국가와 사회는 이를 보장하기 위한 제도를 마련해야 한다. 또한, 모든 국민은 자신의 사생활이 불법적으로 침해되었을 때 적절한 구제를 받을 권리를 가진다. 이와 관련하여 국가는 사생활 보호를 위한 법적 장치를 마련하고, 정보 보호를 위한 정책을 지속적으로 개선해야 한다.",
    "모든 국민은 언론, 출판, 집회 및 결사의 자유를 가지며, 이러한 자유는 공공의 안녕질서를 위하여 필요한 경우에 한하여 법률로써 제한할 수 있다. 국가는 이러한 자유를 보장하기 위해 노력해야 하며, 이러한 자유가 부당하게 침해되지 않도록 보호할 의무를 진다. 이는 국민이 자유롭게 의견을 표현하고, 자신의 사상을 발표할 권리를 보장하기 위한 것이다. 특히, 언론과 출판의 자유는 민주주의 사회에서 국민의 알 권리를 충족시키고, 정부의 투명성과 책임성을 높이는 중요한 수단이다. 따라서 국가는 이러한 자유를 최대한 보장하며, 법률로서 제한하는 경우에도 그 범위를 최소화해야 한다.",
    "모든 국민은 자신의 신체와 재산에 대한 안전을 보장받을 권리를 가지며, 국가와 사회는 이를 보호할 의무를 진다. 국가는 재해로 인하여 생긴 피해를 입은 국민을 보호하기 위하여 노력하여야 하며, 필요한 경우 적절한 보호조치를 취하여야 한다. 이는 국가가 국민의 생명과 재산을 보호하기 위해 적극적으로 나서야 한다는 것을 의미한다. 특히, 국가가 재난이나 위기 상황에서 국민을 보호하고, 피해를 최소화하기 위해 사전에 철저한 준비와 대응책을 마련해야 한다. 또한, 국가는 재난 발생 시 신속하고 적절한 조치를 취하여 국민의 안전을 보장하고, 피해 복구를 지원해야 한다.",
    "모든 국민은 적법한 절차에 따라 자유와 권리를 제한받을 수 있으며, 이러한 제한은 법률로써만 할 수 있다. 범죄로 인하여 생명, 신체, 재산에 피해를 입은 국민은 법률이 정하는 바에 의하여 국가로부터 일정한 배상을 받을 수 있다. 이는 국민의 권리가 부당하게 침해되는 것을 방지하고, 법적 안정성을 보장하기 위한 원칙이다. 국가는 이러한 원칙을 준수하여 국민의 권리를 보호하고, 공정한 법률 절차를 보장해야 한다. 특히, 법률로써 권리를 제한하는 경우에는 그 목적과 범위를 명확히 규정하고, 필요성을 충족시켜야 한다. 이를 통해 국민의 권리가 불필요하게 제한되는 것을 방지하고, 법적 정의를 실현할 수 있다.",
    "모든 국민은 재산권을 가지며, 그 내용과 한계는 법률로 정한다. 재산권의 행사는 공공복리에 적합하도록 하여야 하며, 국가는 필요한 경우 법률이 정하는 바에 따라 재산권의 사용을 제한할 수 있다. 이 경우 정당한 보상이 지급되어야 한다. 이는 개인의 재산권이 법률에 의해 보호받는 동시에, 공공복리를 위해 제한될 수 있다는 것을 의미한다. 특히, 국가는 공익을 위해 필요한 경우 재산권을 제한할 수 있으며, 이 경우 정당한 보상을 통해 국민의 재산권을 보장해야 한다. 또한, 재산권의 사용과 처분은 법률이 정하는 바에 따라 이루어져야 하며, 이는 공공의 이익을 우선적으로 고려해야 한다.",
    "모든 국민은 교육을 받을 권리를 가지며, 국가는 평생교육을 포함한 다양한 교육기회를 제공하여야 한다. 국가는 의무교육을 무상으로 실시하여야 하며, 교육의 중립성과 자율성을 보장하기 위하여 필요한 제도를 마련하여야 한다. 이는 국민이 자신의 잠재력을 최대한 발휘할 수 있도록 교육을 받을 권리를 보장하는 것이다. 특히, 국가는 모든 국민이 기본적인 교육을 받을 수 있도록 의무교육을 실시하고, 이를 통해 사회적 평등을 실현해야 한다. 또한, 교육의 중립성과 자율성을 보장하여 교육이 정치적 또는 상업적 이익에 의해 왜곡되지 않도록 해야 한다.",
    "모든 국민은 근로의 권리를 가지며, 국가는 고용의 증진과 적정임금의 보장에 노력하여야 한다. 국가는 근로조건의 기준을 설정하여 근로자가 인간다운 생활을 할 수 있도록 하여야 하며, 이에 필요한 법률과 제도를 마련해야 한다. 이는 국민이 자신의 능력에 따라 일할 수 있는 권리를 보장하고, 근로의 대가로 적정한 임금을 받을 수 있도록 하는 것이다. 특히, 국가는 노동시장의 공정성과 투명성을 확보하고, 근로자의 권익을 보호하기 위해 적극적으로 나서야 한다. 또한, 근로조건의 개선과 고용안정을 위한 정책을 추진하여, 모든 국민이 안정적인 생활을 영위할 수 있도록 해야 한다.",
    "모든 국민은 공정한 재판을 받을 권리를 가지며, 법률이 정하는 바에 의하여 변호인의 조력을 받을 권리를 가진다. 이는 국민이 법 앞에서 평등하게 대우받을 수 있도록 보장하는 중요한 원칙이다. 국가는 사법부의 독립성을 보장하고, 모든 국민이 공정하고 신속한 재판을 받을 수 있도록 해야 한다. 특히, 형사 피의자나 피고인은 변호인의 조력을 받을 권리가 있으며, 이는 공정한 재판을 받기 위한 필수적인 권리이다. 또한, 국가는 법률로 정하는 절차에 따라 재판을 공개하여 국민의 알 권리를 충족시키고, 사법 절차의 투명성을 높여야 한다.",
    "모든 국민은 자신의 신체와 재산에 대한 안전을 보장받을 권리를 가지며, 국가와 사회는 이를 보호할 의무를 진다. 국가는 재해로 인하여 생긴 피해를 입은 국민을 보호하기 위하여 노력하여야 하며, 필요한 경우 적절한 보호조치를 취하여야 한다. 이는 국가가 국민의 생명과 재산을 보호하기 위해 적극적으로 나서야 한다는 것을 의미한다. 특히, 국가가 재난이나 위기 상황에서 국민을 보호하고, 피해를 최소화하기 위해 사전에 철저한 준비와 대응책을 마련해야 한다. 또한, 국가는 재난 발생 시 신속하고 적절한 조치를 취하여 국민의 안전을 보장하고, 피해 복구를 지원해야 한다.",
    "모든 국민은 사회적 신분에 의해 정치적, 경제적, 사회적 생활의 모든 영역에서 차별받지 아니한다. 국가는 이를 보장하기 위하여 필요한 법률과 제도를 마련하여야 하며, 모든 국민이 평등하게 대우받을 수 있도록 노력하여야 한다. 특히, 국가와 사회는 차별의 원인이 되는 요소를 제거하고, 모든 국민이 동등한 기회를 가질 수 있도록 해야 한다. 또한, 국가는 장애인, 여성, 아동 등 사회적 약자의 권익을 보호하고, 이들이 사회에 완전히 통합될 수 있도록 필요한 조치를 취해야 한다. 이러한 평등의 원칙은 모든 국민이 자신의 능력과 자질에 따라 사회에 참여할 수 있는 기회를 보장한다.",
    "모든 국민은 적법한 절차에 따라 자유와 권리를 제한받을 수 있으며, 이러한 제한은 법률로써만 할 수 있다. 이는 국민의 권리가 부당하게 침해되는 것을 방지하고, 법적 안정성을 보장하기 위한 원칙이다. 국가는 이러한 원칙을 준수하여 국민의 권리를 보호하고, 공정한 법률 절차를 보장해야 한다. 특히, 법률로써 권리를 제한하는 경우에는 그 목적과 범위를 명확히 규정하고, 필요성을 충족시켜야 한다. 이를 통해 국민의 권리가 불필요하게 제한되는 것을 방지하고, 법적 정의를 실현할 수 있다.",
    "모든 국민은 자신의 사상과 양심의 자유를 가지며, 국가는 이를 보장할 의무를 진다. 국가는 국민이 자신의 신념을 자유롭게 표현하고, 이를 실천할 수 있도록 보호해야 한다. 특히, 사상과 양심의 자유는 민주주의 사회의 근본적인 원칙으로, 국민이 자신의 생각을 자유롭게 표명할 수 있는 권리를 의미한다. 국가는 이러한 권리를 보호하기 위해 모든 필요한 조치를 취해야 하며, 사상과 양심의 자유를 제한하는 어떠한 법률도 국민의 기본권을 침해해서는 안 된다. 이와 관련하여 국가는 국민의 사상과 양심의 자유를 보장하는 제도적 장치를 마련해야 한다.",
    "모든 국민은 신앙의 자유를 가지며, 국가는 종교의 자유를 보장해야 한다. 국가는 특정 종교를 지지하거나 우대하지 않으며, 모든 종교가 평등하게 대우받을 수 있도록 해야 한다. 이는 국민이 자신의 신앙을 자유롭게 선택하고, 이를 실천할 수 있는 권리를 보장하는 것이다. 특히, 국가는 종교의 자유를 제한하는 어떠한 법률도 국민의 기본권을 침해하지 않도록 신중을 기해야 한다. 또한, 국가는 종교 간 갈등을 방지하고, 종교의 자유를 보장하기 위한 정책을 추진해야 한다. 이를 통해 모든 국민이 종교적 신념에 따라 자유롭게 생활할 수 있도록 보장해야 한다.",
    "모든 국민은 학문의 자유를 가지며, 국가는 학문과 기술의 발전을 위하여 필요한 조치를 취하여야 한다. 이는 국민이 자신의 학문적 연구와 발표를 자유롭게 할 수 있는 권리를 보장하는 것이다. 특히, 국가는 학문의 자유를 보호하고, 이를 위해 필요한 인프라와 지원을 제공해야 한다. 또한, 국가는 학문과 기술의 발전을 촉진하기 위해 연구개발을 장려하고, 이를 위한 재정적 지원을 제공해야 한다. 이를 통해 학문과 기술이 자유롭게 발전할 수 있는 환경을 조성하고, 국민의 학문적 성취를 최대한으로 지원해야 한다.",
    "모든 국민은 예술의 자유를 가지며, 국가는 예술 활동을 보호하고 지원할 의무를 진다. 이는 국민이 자신의 예술적 표현을 자유롭게 할 수 있는 권리를 보장하는 것이다. 특히, 국가는 예술의 자유를 보호하고, 예술가들이 창작활동을 자유롭게 할 수 있도록 지원해야 한다. 또한, 국가는 예술의 발전을 위하여 필요한 제도적 장치를 마련하고, 예술가들의 권리를 보호하기 위한 법적 조치를 취해야 한다. 이를 통해 국민의 예술적 창작활동이 보호받고, 예술이 자유롭게 발전할 수 있는 환경을 조성해야 한다.",
    "모든 국민은 자신의 재산을 보호받을 권리를 가지며, 국가는 이를 보장할 의무를 진다. 국가는 재산권을 보호하기 위해 필요한 법률과 제도를 마련해야 하며, 재산권이 부당하게 침해되지 않도록 해야 한다. 특히, 국가는 공공복리를 위하여 필요한 경우 재산권을 제한할 수 있으며, 이 경우 정당한 보상을 제공해야 한다. 또한, 국가는 재산권의 행사가 공공복리에 부합하도록 제도를 운영해야 하며, 재산권의 보호를 위한 정책을 지속적으로 개선해야 한다. 이를 통해 모든 국민이 자신의 재산을 안전하게 보호받을 수 있도록 보장해야 한다.",
    "모든 국민은 직업 선택의 자유를 가지며, 국가는 이를 보장할 의무를 진다. 국가는 국민이 자신의 능력과 적성에 따라 직업을 자유롭게 선택할 수 있도록 필요한 조치를 취해야 한다. 특히, 국가는 노동시장의 공정성과 투명성을 확보하고, 모든 국민이 동등한 기회를 가질 수 있도록 노력해야 한다. 또한, 국가는 노동조합을 결성할 권리를 보장하고, 근로자의 권익을 보호하기 위한 정책을 추진해야 한다. 이를 통해 모든 국민이 자신의 직업을 자유롭게 선택하고, 공정한 대우를 받을 수 있도록 보장해야 한다.",
    "모든 국민은 주거의 자유를 가지며, 국가는 국민의 주거안정을 위해 노력할 의무를 진다. 국가는 모든 국민이 적절한 주거 환경에서 생활할 수 있도록 주거 정책을 마련하고, 이를 지원해야 한다. 특히, 국가는 저소득층과 취약계층의 주거 안정을 위해 필요한 조치를 취해야 하며, 주거권을 보장하기 위한 법적 장치를 마련해야 한다. 또한, 국가는 주거 환경의 개선을 위해 노력하고, 국민이 안전하고 쾌적한 주거 환경에서 생활할 수 있도록 해야 한다. 이를 통해 모든 국민이 인간다운 삶을 영위할 수 있는 주거 환경을 보장해야 한다.",
    "모든 국민은 사생활의 비밀과 자유를 침해받지 않을 권리를 가지며, 이는 국가와 사회의 보호를 받는다. 국가는 사생활의 비밀을 보호하기 위한 제도적 장치를 마련하고, 개인정보 보호를 위한 법적 조치를 취해야 한다. 특히, 국가는 사생활 보호를 위한 법률을 제정하고, 이를 엄격히 집행해야 한다. 또한, 국가는 국민의 개인정보가 불법적으로 유출되거나 오용되지 않도록 보호해야 하며, 개인정보 보호를 위한 기술적, 제도적 조치를 강화해야 한다. 이를 통해 모든 국민이 사생활의 비밀과 자유를 안전하게 보호받을 수 있도록 보장해야 한다.",
    "모든 국민은 공공의 안전을 위해 필요한 경우 법률이 정하는 바에 따라 자신의 권리를 제한받을 수 있다. 국가는 공공의 안전과 질서를 유지하기 위해 필요한 조치를 취해야 하며, 국민의 생명과 재산을 보호해야 한다. 특히, 국가는 위기 상황에서 국민을 보호하기 위한 적절한 대응책을 마련하고, 이를 신속하게 집행해야 한다. 또한, 국가는 공공의 안전을 위해 필요한 법률을 제정하고, 이를 엄격히 집행하여 국민의 안전을 보장해야 한다. 이를 통해 모든 국민이 안전하게 생활할 수 있는 환경을 조성하고, 공공의 안전을 보호해야 한다.",
    "모든 국민은 자유롭고 공정한 선거를 통해 자신의 대표자를 선출할 권리를 가진다. 국가는 이를 보장하기 위해 필요한 법적, 제도적 장치를 마련해야 하며, 선거의 공정성을 확보해야 한다. 특히, 국가는 선거 과정에서 부정행위를 방지하고, 모든 유권자가 동등한 기회를 가질 수 있도록 해야 한다. 또한, 국가는 선거 과정에서의 정보 공개를 통해 유권자가 정확한 정보를 바탕으로 판단할 수 있도록 해야 한다. 이를 통해 모든 국민이 자유롭고 공정한 선거를 통해 자신의 대표자를 선출할 수 있는 권리를 보장해야 한다.",
    "모든 국민은 공무담임권을 가지며, 국가는 이를 보장할 의무를 진다. 국가는 공무원의 임용과 승진 과정에서 공정성과 투명성을 확보해야 하며, 모든 국민이 동등한 기회를 가질 수 있도록 해야 한다. 특히, 국가는 공무원의 신분과 직무를 보호하고, 공무원이 공정하고 성실하게 직무를 수행할 수 있도록 필요한 조치를 취해야 한다. 또한, 국가는 공무원의 직무수행을 위한 교육과 훈련을 지원하고, 공무원의 권익을 보호하기 위한 제도를 마련해야 한다. 이를 통해 모든 국민이 공무를 수행할 수 있는 기회를 보장하고, 공직 사회의 공정성을 확보해야 한다.",
    "모든 국민은 자신의 권리를 보호받기 위해 법원에 재판을 청구할 권리를 가진다. 국가는 사법부의 독립성을 보장하고, 모든 국민이 공정하고 신속한 재판을 받을 수 있도록 해야 한다. 특히, 형사 피의자나 피고인은 변호인의 조력을 받을 권리가 있으며, 이는 공정한 재판을 받기 위한 필수적인 권리이다. 또한, 국가는 법률로 정하는 절차에 따라 재판을 공개하여 국민의 알 권리를 충족시키고, 사법 절차의 투명성을 높여야 한다. 이를 통해 모든 국민이 자신의 권리를 보호받을 수 있는 법적 장치를 마련하고, 법적 정의를 실현해야 한다.",
    "모든 국민은 신속한 구제를 받을 권리를 가지며, 국가는 이를 보장할 의무를 진다. 국가는 국민의 권리가 부당하게 침해되었을 때 신속하고 적절한 구제 조치를 취해야 한다. 특히, 국가는 국민이 법적 절차를 통해 신속하게 권리를 구제받을 수 있도록 법률과 제도를 마련해야 한다. 또한, 국가는 국민의 권리 침해에 대한 구제를 위해 적절한 법적 장치를 마련하고, 이를 엄격히 집행해야 한다. 이를 통해 모든 국민이 자신의 권리를 신속하게 구제받을 수 있는 환경을 조성하고, 법적 정의를 실현해야 한다.",
    "모든 국민은 자신의 권리를 보호받기 위해 헌법소원을 청구할 수 있으며, 헌법재판소는 이를 심판할 권한을 가진다. 국가는 국민의 기본권을 침해하는 법률이나 공권력의 행사에 대해 헌법적 판단을 받을 수 있도록 보장해야 한다. 특히, 국가는 헌법재판소의 독립성을 보장하고, 국민의 헌법적 권리가 실질적으로 보호받을 수 있도록 해야 한다. 또한, 국가는 헌법재판소의 판결을 존중하고, 그에 따라 필요한 조치를 취해야 한다. 이를 통해 모든 국민이 자신의 헌법적 권리를 보호받을 수 있는 법적 장치를 마련하고, 헌법적 정의를 실현해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 자신의 재산을 처분할 권리를 가진다. 국가는 이를 보장하기 위해 필요한 법률과 제도를 마련해야 하며, 재산권이 부당하게 침해되지 않도록 해야 한다. 특히, 국가는 공공복리를 위하여 필요한 경우 재산권을 제한할 수 있으며, 이 경우 정당한 보상을 제공해야 한다. 또한, 국가는 재산권의 행사가 공공복리에 부합하도록 제도를 운영해야 하며, 재산권의 보호를 위한 정책을 지속적으로 개선해야 한다. 이를 통해 모든 국민이 자신의 재산을 안전하게 보호받을 수 있도록 보장해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 공무를 수행할 권리를 가진다. 국가는 공무원의 임용과 승진 과정에서 공정성과 투명성을 확보해야 하며, 모든 국민이 동등한 기회를 가질 수 있도록 해야 한다. 특히, 국가는 공무원의 신분과 직무를 보호하고, 공무원이 공정하고 성실하게 직무를 수행할 수 있도록 필요한 조치를 취해야 한다. 또한, 국가는 공무원의 직무수행을 위한 교육과 훈련을 지원하고, 공무원의 권익을 보호하기 위한 제도를 마련해야 한다. 이를 통해 모든 국민이 공무를 수행할 수 있는 기회를 보장하고, 공직 사회의 공정성을 확보해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 국방의 의무를 진다. 국가는 국가의 안전과 질서를 유지하기 위해 필요한 군사력을 유지하고, 국방력을 강화해야 한다. 특히, 국가는 국방의 의무를 성실히 이행하는 국민에게 적절한 대우를 제공해야 하며, 그들의 권익을 보호해야 한다. 또한, 국가는 국방의 의무를 수행하는 과정에서 인권을 존중하고, 법률에 따라 공정하게 처리해야 한다. 이를 통해 모든 국민이 국가의 안전을 위해 국방의 의무를 성실히 이행할 수 있도록 보장하고, 국가의 안보를 강화해야 한다.",
    "모든 국민은 법률이 정하는 바에 따라 납세의 의무를 진다. 국가는 국민이 공정하고 투명한 납세 의무를 이행할 수 있도록 필요한 조치를 취해야 하며, 이를 위한 법적 제도를 마련해야 한다. 특히, 국가는 국민이 자신의 소득과 재산에 따라 공정하게 세금을 부담하도록 하며, 세금이 공정하게 징수되고 사용되도록 해야 한다. 또한, 국가는 납세자의 권익을 보호하고, 세무 행정의 공정성과 투명성을 확보해야 한다. 이를 통해 모든 국민이 공정하고 투명한 납세 의무를 이행할 수 있도록 보장하고, 국가 재정을 건전하게 유지해야 한다.",
    "모든 국민은 국가의 법질서를 준수할 의무를 가지며, 이는 국가의 안전과 질서유지를 위하여 필요하다. 국가는 법질서의 유지와 공공의 안녕을 위해 필요한 조치를 취해야 하며, 국민의 권리와 자유를 보호해야 한다. 특히, 국가는 법질서를 유지하기 위해 법률을 제정하고, 이를 엄격히 집행해야 한다. 또한, 국가는 법질서의 위반을 방지하기 위해 예방적 조치를 취하고, 위반 행위에 대해 적절한 제재를 가해야 한다. 이를 통해 모든 국민이 법질서를 준수하고, 공공의 안녕과 질서를 유지할 수 있도록 해야 한다.",
    "모든 국민은 국가의 안전을 위해 필요한 경우 법률이 정하는 바에 따라 자신의 권리를 제한받을 수 있다. 국가는 국가의 안전과 질서를 유지하기 위해 필요한 법적 제도와 정책을 마련해야 하며, 이를 통해 국민의 생명과 재산을 보호해야 한다. 특히, 국가는 위기 상황에서 국민의 안전을 최우선으로 고려하여 필요한 조치를 취해야 한다. 또한, 국가는 국가의 안전을 위해 필요한 경우 국민의 권리를 제한할 수 있으나, 이 경우에도 법률에 근거하여 신중하게 처리해야 한다. 이를 통해 모든 국민이 안전하게 생활할 수 있는 환경을 조성하고, 국가의 안전을 보장해야 한다.",
    "모든 국민은 적법한 절차에 따라 자유와 권리를 제한받을 수 있으며, 이러한 제한은 법률로써만 할 수 있다. 이는 국민의 권리가 부당하게 침해되는 것을 방지하고, 법적 안정성을 보장하기 위한 원칙이다. 국가는 이러한 원칙을 준수하여 국민의 권리를 보호하고, 공정한 법률 절차를 보장해야 한다. 특히, 법률로써 권리를 제한하는 경우에는 그 목적과 범위를 명확히 규정하고, 필요성을 충족시켜야 한다. 이를 통해 국민의 권리가 불필요하게 제한되는 것을 방지하고, 법적 정의를 실현할 수 있다.",
    "모든 국민은 공공복리를 위하여 자신의 재산을 사용할 수 있으며, 그 사용에 대하여는 정당한 보상을 받을 권리를 가진다. 국가는 국민의 재산권을 보호하고, 공공복리를 위한 재산 사용이 정당하게 이루어질 수 있도록 해야 한다. 특히, 국가는 공공복리를 위하여 필요한 경우 재산권을 제한할 수 있으며, 이 경우 정당한 보상을 제공해야 한다. 또한, 국가는 재산권의 행사가 공공복리에 부합하도록 제도를 운영해야 하며, 재산권의 보호를 위한 정책을 지속적으로 개선해야 한다. 이를 통해 모든 국민이 자신의 재산을 안전하게 보호받을 수 있도록 보장해야 한다."
  ]
}
